# 단일데이터(단일 타입)
# > 수치형 : 정수, 부동소수, 진법, ...
# 파이썬은 모든것이 객체이다
# 10은 수치값이 아닌 객체이다 => 주소값이 변수에 세팅된거라서 
# 대상이 바껴도  ok
# 사전에 정의된 키워드, 내장함수등등 그런 이름을 변수로 쓰면 않된다!!
# 오류도 발생않하고, 의미가 변경된다
a = 10
print( a )
a = 1.1
print( a )
# 타입 확인하는 내장함수 (마치 원래 있었던것 처럼 함수를 사용)
print( type(a) )
# 변수명은 타언어 사용한것과 동일하게 적용
userAge  = 10
user_age = 10
_userAge = 10
# __name__를 직접 구동한 코드에서는 "__main__"으로 나오고
# 외부에서 p1.py를 모듈로 가져와서 구동하면 "p1(파일명)"으로 나온다
# 모듈화에서 테스트코드, 엔트리 포인트 사용시 자주 사용된다
print( __name__, type( __name__ ) ) # 내장변수
# 기본연산은 타 언어와 동일
# 2의 3제곱
print( 2**3 )
# 6을 5로 나누고, 소수점 아래는 버린다
print( 6 / 5 )
print( 6 // 5 )
# 연산자 우선순위를 모르겟다 => ()를써서 우선순위를 두면된다
# 파이썬에서는 튜플과 구분이 필요하다

