
# 변수
x, y = 0, 0 # 좌표값
width, height = 5, 5 # 블록 사이즈 인가??
vel = 1
SCREEN_WIDTH, SCREEN_HEIGHT = 600, 500  # 창 너비: 600 ,창 높이: 500
# BLOCK_SIZE    = 10  # 블록 고정 ??
isJump = False
jumpCount = 10


# 여러가지 색 // 0-255 ( R, B, G )
RED    = 255, 0, 0       # 적색:   적 255, 녹   0, 청   0
GREEN  = 0, 255, 0       # 녹색:   적   0, 녹 255, 청   0
BLUE   = 0, 0, 255       # 청색:   적   0, 녹   0, 청 255
PURPLE = 127, 0, 127     # 보라색: 적 127, 녹   0, 청 127
BLACK  = 0, 0, 0         # 검은색: 적   0, 녹   0, 청   0
GRAY   = 127, 127, 127   # 회색:   적 127, 녹 127, 청 127
WHITE  = 255, 255, 255   # 하얀색: 적 255, 녹 255, 청 255

