# 여러가지 색
# 0-255 ( R, B, G )
RED   = 255, 0, 0        # 적색:   적 255, 녹   0, 청   0
GREEN = 0, 255, 0      # 녹색:   적   0, 녹 255, 청   0
BLUE  = 0, 0, 255       # 청색:   적   0, 녹   0, 청 255
PURPLE = 127, 0, 127   # 보라색: 적 127, 녹   0, 청 127
BLACK = 0, 0, 0        # 검은색: 적   0, 녹   0, 청   0
GRAY  = 127, 127, 127   # 회색:   적 127, 녹 127, 청 127
WHITE   = 255, 255, 255  # 하얀색: 적 255, 녹 255, 청 255
SILVER  = 204, 204, 204 # 은색  : 적 204, 녹 204, 청 204
BBARRY  = 204, 204, 255
#DPGREEN = 000, 050, 000
PINK   = 255, 204, 204
PEACH  = 255, 153, 153
#DPBLUE = 000, 051, 153
YELLOW = 255, 255, 000
HEXGRAY = 102, 102, 102